thrombosis_AB/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

brinkmanSource
{
    type            vectorCodedSource;
    selectionMode   all;

    fields          (U);
    name            brinkmanSource;
    
    codeInclude
    #{
    #};
    
    codeCorrect
    #{
    #};

    codeAddSup
    #{      
        
        Pout<< "**codeAddSup**" << endl;
        
        const scalarField& epsTemp = mesh_.lookupObject<volScalarField>("eps");
        const vectorField& U = mesh_.lookupObject<volVectorField>("U");
        const scalarField& V = mesh_.V();
            
        const scalar nuTemp = 3.5e-06;
        const scalar eps_tTemp = 5.0e18;
        const scalar kTemp = 9.56e-10;
        
        vectorField& epSource = eqn.source();
        
        forAll(epSource, i)
        {
            epSource[i] = (nuTemp*(1.0/kTemp)*U[i]*(epsTemp[i]/eps_tTemp)/(1.0 + (epsTemp[i]/eps_tTemp)))*V[i];
        }
    #};
}


// ************************************************************************* //
