thrombosis_AB/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 1e-05;

D_RP		[0 2 -1 0 0 0 0] 1.58e-11;

D_AP		[0 2 -1 0 0 0 0] 1.58e-11;

D_ADP		[0 2 -1 0 0 0 0] 2.57e-8;

D_TxA_2		[0 2 -1 0 0 0 0] 2.14e-8;

D_PT		[0 2 -1 0 0 0 0] 3.32e-9;

D_TRB		[0 2 -1 0 0 0 0] 4.16e-9;

D_AT		[0 2 -1 0 0 0 0] 3.49e-9;

lambda_j	[0 0 0 0 1 0 0] 2.4e-17;

k_1j		[0 0 -1 0 0 0 0] 0.0161;

s_pj		[0 0 -1 0 1 0 0] 9.5e-21;

beta		[0 0 0 0 1 0 0] 9.11e-12;

phi_at		[0 3 -1 0 -1 0 0] 3.69e-6;

phi_rt		[0 3 -1 0 -1 0 0] 6.50e-7;

t_act		[0 0 1 0 0 0 0] 1;

k_1T		[0 0 -1 0 0 0 0] 13.333;

H		[0 -3 0 0 1 0 0] 0.417e-3;

alpha		[0 0 0 0 0 0 0] 1.0;

K_AT		[0 -3 0 0 1 0 0] 0.100e-3;

K_T		[0 -3 0 0 1 0 0] 3.50e-5;

k_const		[0 2 0 0 0 0 0] 9.56e-16;

alpha_epsilon	[0 3 -1 0 0 0 0] 3.7e-11;

B		[0 0 -1 0 0 0 0] 2.0e3;

tau_low_wall	[1 -1 -2 0 0 0 0] 0.02;

tau_high_wall	[1 -1 -2 0 0 0 0] 0.15;

tau_bd_wall	[1 -1 -2 0 0 0 0] 0.8;

tau_low_thr	[1 -1 -2 0 0 0 0] 0.1;

tau_high_thr	[1 -1 -2 0 0 0 0] 0.3;

tau_bd_thr	[1 -1 -2 0 0 0 0] 0.9;

epsilon_t	[0 -3 0 0 0 0 0] 5.25e-18;

rho		[1 -3 0 0 0 0 0] 1.060e3;

// ************************************************************************* //
