thrombosis_AB/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    "(U|k|epsilon|omega|f|v2)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    RP
    {
	solver		PBiCG;
	preconditioner	DILU;
	tolerence	1e-06;
	relTol		0;
    }

    AP
    {
	solver		PBiCG;
	preconditioner	DILU;
	tolerence	1e-06;
	relTol		0;
    }

    ADP
    {
	solver		PBiCG;
	preconditioner	DILU;
	tolerence	1e-06;
	relTol		0;
    }

    TxA_2
    {
	solver		PBiCG;
	preconditioner	DILU;
	tolerence	1e-06;
	relTol		0;
    }

    PT
    {
	solver		PBiCG;
	preconditioner	DILU;
	tolerence	1e-06;
	relTol		0;
    }

    TRB
    {
	solver		PBiCG;
	preconditioner	DILU;
	tolerence	1e-06;
	relTol		0;
    }

    AT
    {
	solver		PBiCG;
	preconditioner	DILU;
	tolerence	1e-06;
	relTol		0;
    }

    eps
    {
	solver		PBiCG;
	preconditioner	DILU;
	tolerence	1e-06;
	relTol		0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    residualControl
    {
        p               1e-2;
        U               1e-3;
        "(k|epsilon|omega|f|v2)" 1e-3;
        AP               1e-3;
        RP               1e-3;
        ADP               1e-3;
        TxA_2               1e-3;
        PT               1e-3;
        TRB               1e-3;
        AT               1e-3;
        eps               1e-3;
    }
}

relaxationFactors
{
    equations
    {
        U               0.9; // 0.9 is more stable but 0.95 more convergent
        ".*"            0.9; // 0.9 is more stable but 0.95 more convergent
    }
}


// ************************************************************************* //
